ab-benchmark-20req-1cuncurrent-pre-cache.log
This is ApacheBench, Version 2.3 <$Revision: 1826891 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /
Document Length:        20688 bytes

Concurrency Level:      1
Time taken for tests:   15.174 seconds
Complete requests:      20
Failed requests:        0
Total transferred:      418780 bytes
HTML transferred:       413760 bytes
Requests per second:    1.32 [#/sec] (mean)
Time per request:       758.715 [ms] (mean)
Time per request:       758.715 [ms] (mean, across all concurrent requests)
Transfer rate:          26.95 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:   641  759  77.9    776     948
Waiting:      641  758  77.9    775     948
Total:        641  759  77.9    776     948

Percentage of the requests served within a certain time (ms)
  50%    776
  66%    799
  75%    819
  80%    821
  90%    829
  95%    948
  98%    948
  99%    948
 100%    948 (longest request)